; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	infrared1 - mode
	image3 - mode
	thermograph4 - mode
	infrared5 - mode
	image0 - mode
	GroundStation3 - direction
	GroundStation7 - direction
	Star4 - direction
	Star6 - direction
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	GroundStation5 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph4)
	(supports instrument4 infrared5)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(have_image Phenomenon8 thermograph4)
	(have_image Planet9 infrared1)
	(have_image Planet10 image3)
	(have_image Star11 infrared1)
	(have_image Star11 infrared5)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 image3)
	(have_image Phenomenon13 infrared1)
))

)

; plan
1. (turn_to satellite1 star0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star0)
   goals met: 0 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon8 instrument4 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon13 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 8
7. (turn_to satellite0 star2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star2)
   goals met: 1 of 8
8. (take_image satellite1 phenomenon13 instrument4 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 3 of 8
13. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
14. (take_image satellite0 phenomenon13 instrument0 image3)
   added: (have_image phenomenon13 image3)
   goals met: 4 of 8
15. (turn_to satellite0 planet10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet10)
   goals met: 4 of 8
16. (take_image satellite0 planet10 instrument0 image3)
   added: (have_image planet10 image3)
   goals met: 5 of 8
17. (turn_to satellite1 planet9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet9)
   goals met: 5 of 8
18. (take_image satellite1 planet9 instrument4 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 6 of 8
19. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
20. (take_image satellite1 star11 instrument4 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 8
21. (take_image satellite1 star11 instrument4 infrared5)
   added: (have_image star11 infrared5)
   goals met: 8 of 8
